# SolidOrShellTessellationControls Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SolidOrShellTessellationControls Methods
SolidOrShellTessellationControls Class See Also
---
The SolidOrShellTessellationControls type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| DisableLevelOfDetail | Disables the use of levelOfDetail. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |
| UseLevelOfDetail | Returns true if the use of levelOfDetail is enabled, false if not. The use of levelOfDetail is enabled by calling setLevelOfDetail (with a valid input). |

# See Also
SolidOrShellTessellationControls Class
Autodesk.Revit.DB Namespace